{
  "activation": "gelu",
  "architectures": [
    "DistilBertForTokenClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.3,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Capacitance",
    "1": "Category",
    "2": "Color",
    "3": "Compliance",
    "4": "Current",
    "5": "Frequency",
    "6": "IGNORE",
    "7": "Inductance",
    "8": "O",
    "9": "Package",
    "10": "Pin_Count",
    "11": "Power",
    "12": "Process_Type",
    "13": "Resistance",
    "14": "Size",
    "15": "Temp_Code",
    "16": "Temp_Coefficient",
    "17": "Tolerance",
    "18": "Type",
    "19": "Voltage",
    "20": "Wavelength"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Capacitance": 0,
    "Category": 1,
    "Color": 2,
    "Compliance": 3,
    "Current": 4,
    "Frequency": 5,
    "IGNORE": 6,
    "Inductance": 7,
    "O": 8,
    "Package": 9,
    "Pin_Count": 10,
    "Power": 11,
    "Process_Type": 12,
    "Resistance": 13,
    "Size": 14,
    "Temp_Code": 15,
    "Temp_Coefficient": 16,
    "Tolerance": 17,
    "Type": 18,
    "Voltage": 19,
    "Wavelength": 20
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
